crowdwave/ch559samplestranslated/EVT/EXAM/USB/U_DISK/EXAM1/EXAM1.C
/********************************** (C) COPYRIGHT *********** ********************
* File Name :EXAM1.C
* Author: WCH
* Version: V1.3
* Date: 2016/06/24
* Description:
 CH559 C language U disk file byte read and write sample program,
 Demonstrate searching for the /C51/CH559HFT.C file, if found, read the first 100 bytes of the file;
 Demonstrate the creation of the /NEWFILE.TXT file, write cyclic bytes into the specified string, and modify the file attributes;
 Demo to modify the 1.TXT file name to 2.C
 Demonstrate deleting the /OLD.TXT file;
 Support: FAT12/FAT16/FAT32
************************************************** *****************************/
#include <CH559.H>
#include <stdio.h>
#include <string.h>
#include "..\..\..\DEBUG.H"
#include "..\..\..\DEBUG.C"
//#define DISK_BASE_BUF_LEN 512 /* The default disk data buffer size is 512 bytes (you can choose 2048 or even 4096 to support some large-sector U disks). If it is 0, it is forbidden to define the buffer in this file and Specified by the application in pDISK_BASE_BUF*/
#define FOR_ROOT_UDISK_ONLY 1 // Only used for U disk file operation of DP/DM port (using subroutine library CH559UFI/X), does not support U disk operation under HUB
//You also need to add LIB library files
//#define NO_DEFAULT_ACCESS_SECTOR 1 /* The default disk sector read and write subroutine is forbidden, and replace it with a self-written program below */
//#define NO_DEFAULT_DISK_CONNECT 1 /* The default check disk connection subroutine is forbidden, replace it with a self-written program below */
//#define NO_DEFAULT_FILE_ENUMER 1 /* The default file name enumeration callback program is prohibited, and replace it with a self-written program below */
#include "..\..\..\USB_LIB\CH559UFI.H"
#include "..\..\..\USB_LIB\CH559UFI.C"

#pragma NOAREGS

// Each subroutine returns status code
#define ERR_SUCCESS 0x00 // operation is successful
#define ERR_USB_CONNECT 0x15 /* A USB device connection event has been detected and has been connected */
#define ERR_USB_DISCON 0x16 /* A USB device disconnection event has been detected and has been disconnected */
#define ERR_USB_BUF_OVER 0x17 /* The data transmitted by USB is wrong or there is too much data and buffer overflow */
#define ERR_USB_DISK_ERR 0x1F /* USB storage operation failed, it may be that the USB storage is not supported during initialization, and the disk may be damaged or disconnected during read and write operations */
#define ERR_USB_TRANSFER 0x20 /* NAK/STALL and other error codes are in 0x20~0x2F */
#define ERR_USB_UNSUPPORT 0xFB
#define ERR_USB_UNKNOWN 0xFE
#define WAIT_USB_TOUT_200US 200 // Waiting for USB interrupt timeout time 200uS@Fsys=12MHz
#define SetUsbSpeed( x)

// Get device descriptor
UINT8C SetupGetDevDescr[] = {USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_DEVICE, 0x00, 0x00, sizeof( USB_DEV_DESCR ), 0x00 };
// Get configuration descriptor
UINT8C SetupGetCfgDescr[] = {USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_CONFIG, 0x00, 0x00, 0x04, 0x00 };
// Set the USB address
UINT8C SetupSetUsbAddr[] = {USB_REQ_TYP_OUT, USB_SET_ADDRESS, USB_DEVICE_ADDR, 0x00, 0x00, 0x00, 0x00, 0x00 };
// Set USB configuration
UINT8C SetupSetUsbConfig[] = {USB_REQ_TYP_OUT, USB_SET_CONFIGURATION, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
// Clear endpoint STALL
UINT8C SetupClrEndpStall[] = {USB_REQ_TYP_OUT | USB_REQ_RECIP_ENDP, USB_CLEAR_FEATURE, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
UINT8X UsbDevEndp0Size; /* The maximum packet size of endpoint 0 of the USB device */
//USB device related information table, CH559 supports up to 2 devices
#define ROOT_DEV_DISCONNECT 0
#define ROOT_DEV_CONNECTED 1
#define ROOT_DEV_FAILED 2
#define ROOT_DEV_SUCCESS 3
UINT8X RxBuffer[ MAX_PACKET_SIZE] _at_ 0x0000; // IN, must even address
UINT8X TxBuffer[ MAX_PACKET_SIZE] _at_ 0x0040; // OUT, must even address
#define pSetupReq ((PXUSB_SETUP_REQ)TxBuffer)

struct _RootHubDev{
UINT8 DeviceStatus; // Device status, 0-no device, 1-device but not initialized, 2-device but initialization enumeration failed, 3-device and initialization enumeration succeeded
UINT8 DeviceAddress; // The assigned USB address of the device
UINT8 DeviceSpeed; // 0 is low speed, non-zero is full speed
UINT8 DeviceType; // Device type
UINT8 GpVar; // General variable
} xdata RootHubDev[2];

bit FoundNewDev;
bit RootHubId; // The currently operating root-hub port number: 0=HUB0,1=HUB1
#pragma NOAREGS

void mDelayuS( UINT16 n ); // Delay in uS
void mDelaymS( UINT16 n ); // Delay in mS
void DisableRootHubPort( UINT8 RootHubIndex ); // Close the port, in fact the hardware has been automatically closed, here is just to clear some structure states
UINT8 AnalyzeRootHub( void ); // Analyze the port status and process the ROOT-HUB port device plug-in event
// Return ERR_SUCCESS for no condition, return ERR_USB_CONNECT for new connection detected, return ERR_USB_DISCON for detected disconnection
void SetHostUsbAddr( UINT8 addr ); // Set the USB device address currently operated by the USB host
void ResetRootHubPort( UINT8 RootHubIndex ); // After the device is detected, reset the bus to prepare for enumerating the device, and set it to default to full speed
UINT8 EnableRootHubPort( UINT8 RootHubIndex ); // Enable the port, and the corresponding bUH_PORT_EN is set to 1 to enable the port, and the device disconnection may cause the return failure
void SelectHubPort( UINT8 RootHubIndex); // Select the ROOT-HUB port specified by the operation
UINT8 WaitUSB_Interrupt( void ); // Wait for USB interrupt
// CH559 transfer transaction, enter the destination endpoint address/PID token, synchronization flag, the total NAK retry time in units of 20uS (0 means no retry, 0xFFFF unlimited retry), return 0 success, timeout/error retry
UINT8 USBHostTransact( UINT8 endp_pid, UINT8 tog, UINT16 timeout ); // endp_pid: the upper 4 bits are the token_pid token, the lower 4 bits are the endpoint address
UINT8 HostCtrlTransfer( PUINT8X DataBuf, PUINT8I RetLen ); // Perform control transfer, 8-byte request code is in pSetupReq, DataBuf is an optional transmit and receive buffer
// If you need to receive and send data, then DataBuf needs to point to a valid buffer for storing subsequent data, and the total length of the actual successfully sent and received is returned and saved in the byte variable pointed to by ReqLen
void CopySetupReqPkg( PUINT8C pReqPkt ); // Copy control transmission request packet
UINT8 CtrlGetDeviceDescr( void ); // Get the device descriptor and return it in TxBuffer
UINT8 CtrlGetConfigDescr( void ); // Get the configuration descriptor and return it in TxBuffer
UINT8 CtrlSetUsbAddress( UINT8 addr ); // Set USB device address
UINT8 CtrlSetUsbConfig( UINT8 cfg ); // Set USB device configuration
UINT8 CtrlClearEndpStall( UINT8 endp ); // Clear endpoint STALL
UINT8 InitRootDevice( UINT8 RootHubIndex ); // Initialize the USB device
UINT8 EnumAllRootDevice( void ); // Enumerate all USB devices of ROOT-HUB port
void mInitSTDIO( void ); //Initialize the serial port for printf and getkey input and output
UINT16 SearchTypeDevice( UINT8 type ); //Search the specified device
void InitUSB_Host( void ); // Initialize the USB host
void mStopIfError( UINT8 iError ); //Check the operation status, if there is an error, display the error code and stop

