crowdwave/ch559samplestranslated/EVT/EXAM/USB/U_DISK/EXAM1/EXAM1.C
/************************************************* ******************************
* Function Name: DisableRootHubPort(UINT8 RootHubIndex)
* Description: Close the port, in fact the hardware has been automatically closed, here is just to clear some structure states
* Input: UINT8 RootHubIndex HUB port
* Output: None
* Return: None
************************************************** *****************************/
void DisableRootHubPort( UINT8 RootHubIndex)
{
RootHubDev[ RootHubIndex ].DeviceStatus = ROOT_DEV_DISCONNECT;
RootHubDev[ RootHubIndex ].DeviceAddress = 0x00;
if (RootHubIndex == 1) UHUB1_CTRL = 0x00; // Clear the control data related to HUB1, actually does not need to be cleared
else UHUB0_CTRL = 0x00; // Clear the control data related to HUB0, actually does not need to be cleared
}
/************************************************* ******************************
* Function Name: AnalyzeRootHub(void)
* Description: Analyze port status and handle port device plug-in events
                   Handle the plug-in event of the port. If the device is unplugged, call the DisableRootHubPort() function in the function to close the port, insert the event, and set the status bit of the corresponding port
* Input: None
* Output: None
* Return: Return ERR_SUCCESS for no condition, return ERR_USB_CONNECT for new connection detected, return ERR_USB_DISCON for disconnection detected
************************************************** *****************************/
UINT8 AnalyzeRootHub( void)
{
UINT8 s = ERR_SUCCESS;
if (USB_HUB_ST & bUHS_H0_ATTACH) {// device exists
if (RootHubDev[0].DeviceStatus == ROOT_DEV_DISCONNECT // Detected device insertion
|| (UHUB0_CTRL & bUH_PORT_EN) == 0x00) {// Device insertion is detected, but it is not yet allowed, indicating that it has just been inserted
DisableRootHubPort( 0 ); // Close the port
RootHubDev[0].DeviceSpeed ​​= USB_HUB_ST & bUHS_DM_LEVEL? 0: 1;
RootHubDev[0].DeviceStatus = ROOT_DEV_CONNECTED; //Set connection flag
printf( "HUB 0 dev in\n" );
s = ERR_USB_CONNECT;
}
}
else if (RootHubDev[0].DeviceStatus >= ROOT_DEV_CONNECTED) {//The device is unplugged
DisableRootHubPort( 0 ); // Close the port
printf( "HUB 0 dev out\n" );
if (s == ERR_SUCCESS) s = ERR_USB_DISCON;
}
if (USB_HUB_ST & bUHS_H1_ATTACH) {// device exists
if (RootHubDev[1].DeviceStatus == ROOT_DEV_DISCONNECT // Detected device insertion
|| (UHUB1_CTRL & bUH_PORT_EN) == 0x00) {// Device insertion is detected, but it is not yet allowed, indicating that it has just been inserted
DisableRootHubPort( 1 ); // Close the port
RootHubDev[1].DeviceSpeed ​​= USB_HUB_ST & bUHS_HM_LEVEL? 0: 1;
RootHubDev[1].DeviceStatus = ROOT_DEV_CONNECTED; //Set connection flag
printf( "HUB 1 dev in\n" );
s = ERR_USB_CONNECT;
}
}
else if (RootHubDev[1].DeviceStatus >= ROOT_DEV_CONNECTED) {//The device is unplugged
DisableRootHubPort( 1 ); // Close the port
printf( "HUB 1 dev out\n" );
if (s == ERR_SUCCESS) s = ERR_USB_DISCON;
}
return( s );
}
/************************************************* ******************************
* Function Name: SetHostUsbAddr
* Description: Set the USB device address currently operated by the USB host
* Input: UINT8 addr
* Output: None
* Return: None
************************************************** *****************************/
void SetHostUsbAddr( UINT8 addr)
{
    USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | addr & 0x7F;
}
/************************************************* ******************************
* Function Name: ResetRootHubPort
* Description: After the device is detected, reset the bus to prepare for enumerating the device, and set it to default to full speed
* Input: UINT8 RootHubIndex
* Output: None
* Return: None
************************************************** *****************************/
void ResetRootHubPort( UINT8 RootHubIndex)
{
UsbDevEndp0Size = DEFAULT_ENDP0_SIZE; //Maximum packet size of endpoint 0 of the USB device
SetHostUsbAddr( 0x00 );
SetUsbSpeed( 1 ); // The default is full speed
if (RootHubIndex == 1) {
UHUB1_CTRL = UHUB1_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;// The default is full speed, start reset
mDelaymS( 15 ); // reset time 10mS to 20mS
UHUB1_CTRL = UHUB1_CTRL & ~ bUH_BUS_RESET;// End reset
}
else {
UHUB0_CTRL = UHUB0_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;// The default is full speed, start reset
mDelaymS( 15 ); // reset time 10mS to 20mS
UHUB0_CTRL = UHUB0_CTRL & ~ bUH_BUS_RESET; // end reset
}
mDelayuS( 250 );
UIF_DETECT = 0; // Clear interrupt flag
}
/************************************************* ******************************
* Function Name: EnableRootHubPort
* Description: Enable the port, the corresponding bUH_PORT_EN is set to 1 to enable the port, the device may be disconnected, which may cause the return failure
* Input: UINT8 RootHubIndex
* Output: None
* Return: Return ERR_SUCCESS to detect a new connection, return ERR_USB_DISCON to indicate no connection
************************************************** *****************************/
UINT8 EnableRootHubPort( UINT8 RootHubIndex)
{
if (RootHubDev[ RootHubIndex ].DeviceStatus <ROOT_DEV_CONNECTED) RootHubDev[ RootHubIndex ].DeviceStatus = ROOT_DEV_CONNECTED;
if (RootHubIndex == 1) {
if (USB_HUB_ST & bUHS_H1_ATTACH) {// There is equipment
if ((UHUB1_CTRL & bUH_PORT_EN) == 0x00) {// not yet enabled
RootHubDev[1].DeviceSpeed ​​= USB_HUB_ST & bUHS_HM_LEVEL? 0: 1;
if (RootHubDev[1].DeviceSpeed ​​== 0) UHUB1_CTRL |= bUH_LOW_SPEED; // low speed
}
UHUB1_CTRL |= bUH_PORT_EN; //Enable HUB port
return( ERR_SUCCESS );
}
}
else {
if (USB_HUB_ST & bUHS_H0_ATTACH) {// There is equipment
if ((UHUB0_CTRL & bUH_PORT_EN) == 0x00) {// not yet enabled
RootHubDev[0].DeviceSpeed ​​= USB_HUB_ST & bUHS_DM_LEVEL? 0: 1;
if (RootHubDev[0].DeviceSpeed ​​== 0) UHUB0_CTRL |= bUH_LOW_SPEED; // low speed
}
UHUB0_CTRL |= bUH_PORT_EN; //Enable HUB port
return( ERR_SUCCESS );
}
}
return( ERR_USB_DISCON );
}
/************************************************* ******************************
* Function Name: SelectHubPort
* Description: Select the ROOT-HUB port specified by the operation
* Input: UINT8 RootHubIndex
* Output: None
* Return: Return ERR_SUCCESS to detect a new connection, return ERR_USB_DISCON to indicate no connection
************************************************** *****************************/
void SelectHubPort( UINT8 RootHubIndex)
{// Select the ROOT-HUB port specified by the operation
SetHostUsbAddr( RootHubDev[RootHubIndex].DeviceAddress ); // Set the USB device address currently operated by the USB host
SetUsbSpeed( RootHubDev[RootHubIndex].DeviceSpeed ​​); // Set the current USB speed
RootHubId = RootHubIndex? 1: 0;
}
/************************************************* ******************************
* Function Name: WaitUSB_Interrupt
* Description: Wait for USB interrupt
* Input: None
* Output: None
* Return: return ERR_SUCCESS data received or sent successfully
                   ERR_USB_UNKNOWN Data receiving or sending failed
************************************************** *****************************/
UINT8 WaitUSB_Interrupt( void)
{
    UINT16 i;
    for (i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i - ){;}
    return( UIF_TRANSFER? ERR_SUCCESS: ERR_USB_UNKNOWN );
}
/************************************************* ******************************
* Function Name: USBHostTransact
* Description: CH559 transmission transaction, enter the destination endpoint address/PID token, synchronization flag, the total NAK retry time in units of 20uS (0 means no retry, 0xFFFF unlimited retry), return 0 success, timeout/error retry test
                   This subroutine focuses on easy to understand, and in actual applications, in order to provide running speed, the code of this subroutine should be optimized
* Input: UINT8 endp_pid token and address endp_pid: the upper 4 bits are the token_pid token, the lower 4 bits are the endpoint address
                   UINT8 tog synchronization flag
                   UINT16 timeout timeout
* Output: None
* Return: ERR_USB_UNKNOWN timed out, the hardware may be abnormal
                   ERR_USB_DISCON Device disconnect
                   ERR_USB_CONNECT Device connection
                   ERR_SUCCESS transfer completed
************************************************** *****************************/
UINT8 USBHostTransact( UINT8 endp_pid, UINT8 tog, UINT16 timeout)
{
// UINT8 TransRetry;
#define TransRetry UEP0_T_LEN // Save memory
    UINT8 s, r;
    UINT16 i;
    UH_RX_CTRL = UH_TX_CTRL = tog;
    TransRetry = 0;
    do
    {
// LED_TMP = 0;
        UH_EP_PID = endp_pid; // Specify the token PID and destination endpoint number
        UIF_TRANSFER = 0; // Allow transmission
// s = WaitUSB_Interrupt( );
        for (i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i - ){;}
        UH_EP_PID = 0x00; // Stop USB transmission
// LED_TMP = 1;
// if (s != ERR_SUCCESS) return( s ); // interrupt timeout, it may be a hardware abnormality
        if (UIF_TRANSFER == 0)
        {
            return( ERR_USB_UNKNOWN );
        }
        if (UIF_DETECT) // USB device plug-in event
        {
// mDelayuS( 200 ); // Wait for the transfer to complete
            UIF_DETECT = 0; // Clear interrupt flag
            s = AnalyzeRootHub( ); // analyze ROOT-HUB status
            if (s == ERR_USB_CONNECT)
            {
                FoundNewDev = 1;
            }
            if (CH559DiskStatus == DISK_DISCONNECT)
            {
                return( ERR_USB_DISCON ); // USB device disconnect event
            }
            if (CH559DiskStatus == DISK_CONNECT)
            {
                return( ERR_USB_CONNECT ); // USB device connection event
            }
// if ((USB_HUB_ST & bUHS_H0_ATTACH) == 0x00) return( ERR_USB_DISCON );// USB device disconnect event
            mDelayuS( 200 ); // Wait for the transmission to complete
        }
        if (UIF_TRANSFER) // transfer completed
        {
            if (U_TOG_OK)
            {
                return( ERR_SUCCESS );
            }
#ifdef DEBUG_NOW
            printf("endp_pid=%02X\n",(UINT16)endp_pid);
            printf("USB_INT_FG=%02X\n",(UINT16)USB_INT_FG);
            printf("USB_INT_ST=%02X\n",(UINT16)USB_INT_ST);
            printf("USB_MIS_ST=%02X\n",(UINT16)USB_MIS_ST);
            printf("USB_RX_LEN=%02X\n",(UINT16)USB_RX_LEN);
            printf("UH_TX_LEN=%02X\n",(UINT16)UH_TX_LEN);
            printf("UH_RX_CTRL=%02X\n",(UINT16)UH_RX_CTRL);
            printf("UH_TX_CTRL=%02X\n",(UINT16)UH_TX_CTRL);
            printf("UHUB0_CTRL=%02X\n",(UINT16)UHUB0_CTRL);
            printf("UHUB1_CTRL=%02X\n",(UINT16)UHUB1_CTRL);
#endif
            r = USB_INT_ST & MASK_UIS_H_RES; // USB device response status
            if (r == USB_PID_STALL)
            {
                return( r | ERR_USB_TRANSFER );
            }
            if (r == USB_PID_NAK)
            {
                if (timeout == 0)
                {
                    return( r | ERR_USB_TRANSFER );
                }
                if (timeout <0xFFFF)
                {
                    timeout --;
                }
                - TransRetry;
            }
            else switch (endp_pid >> 4)
                {
                case USB_PID_SETUP:
                case USB_PID_OUT:
// if (U_TOG_OK) return( ERR_SUCCESS );
// if (r == USB_PID_ACK) return( ERR_SUCCESS );
// if (r == USB_PID_STALL || r == USB_PID_NAK) return( r | ERR_USB_TRANSFER );
                    if (r)
                    {
                        return( r | ERR_USB_TRANSFER ); // Not a timeout/error, unexpected response
                    }
                    break; // Retry after timeout
                case USB_PID_IN:
// if (U_TOG_OK) return( ERR_SUCCESS );
// if (tog? r == USB_PID_DATA1: r == USB_PID_DATA0) return( ERR_SUCCESS );
// if (r == USB_PID_STALL || r == USB_PID_NAK) return( r | ERR_USB_TRANSFER );
                    if (r == USB_PID_DATA0 && r == USB_PID_DATA1 )// If out of sync, you need to discard and try again
                    {} // Retry without synchronization
                    else if (r)
                    {
                        return( r | ERR_USB_TRANSFER ); // Not a timeout/error, unexpected response
                    }
                    break; // Retry after timeout
                default:
                    return( ERR_USB_UNKNOWN ); // impossible situation
                    break;
                }
        }
        else // other interrupts, things that shouldn't happen
        {
            USB_INT_FG = 0xFF; // Clear interrupt flag
        }
        mDelayuS( 15 );
    }
    while (++ TransRetry <3 );
    return( ERR_USB_TRANSFER ); // Response timeout
}
/************************************************* ******************************
* Function Name: HostCtrlTransfer
* Description: Perform control transmission, the 8-byte request code is in pSetupReq, and DataBuf is an optional transceiver buffer
* Input: PUINT8X DataBuf If you need to receive and send data, then DataBuf needs to point to a valid buffer for storing subsequent data
                   The total length of PUINT8I RetLen actually successfully transmitted and received is stored in the byte variable pointed to by RetLen
* Output: None
* Return: ERR_USB_BUF_OVER IN state phase error
                   ERR_SUCCESS Data exchange is successful
                   Other error status
************************************************** *****************************/
UINT8 HostCtrlTransfer( PUINT8X DataBuf, PUINT8I RetLen)
{
    UINT8 s, RemLen, RxLen, RxCnt, TxCnt;
    PUINT8X xdata pBuf;
    PUINT8I xdata pLen;
    pBuf = DataBuf;
    pLen = RetLen;
    mDelayuS( 200 );
    if (pLen)
    {
        *pLen = 0; // The total length of actual successful sending and receiving
    }
    UH_TX_LEN = sizeof( USB_SETUP_REQ );
    s = USBHostTransact( USB_PID_SETUP << 4 | 0x00, 0x00, 200000/20 ); // SETUP phase, 200mS timeout
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    UH_RX_CTRL = UH_TX_CTRL = bUH_R_TOG | bUH_R_AUTO_TOG | bUH_T_TOG | bUH_T_AUTO_TOG;// Default DATA1
    UH_TX_LEN = 0x01; // There is no data by default, so the status stage is IN
    RemLen = pSetupReq -> wLengthH? 0xFF: pSetupReq -> wLengthL;
    if (RemLen && pBuf) // Need to send and receive data
    {
        if (pSetupReq -> bRequestType & USB_REQ_TYP_IN) // accept
        {
            while (RemLen)
            {
                mDelayuS( 200 );
                s = USBHostTransact( USB_PID_IN << 4 | 0x00, UH_RX_CTRL, 200000/20 );// IN data
                if (s != ERR_SUCCESS)
                {
                    return( s );
                }
                RxLen = USB_RX_LEN <RemLen? USB_RX_LEN: RemLen;
                RemLen -= RxLen;
                if (pLen)
                {
                    *pLen += RxLen; // The total length of actual successful sending and receiving
                }
// memcpy( pBuf, RxBuffer, RxLen );
// pBuf += RxLen;
                for (RxCnt = 0; RxCnt != RxLen; RxCnt ++)
                {
                    *pBuf = RxBuffer[ RxCnt ];
                    pBuf ++;
                }
                if (USB_RX_LEN == 0 || (USB_RX_LEN & (UsbDevEndp0Size-1)))
                {
                    break; // short package
                }
            }
            UH_TX_LEN = 0x00; // The status phase is OUT
        }
        else // send
        {
            while (RemLen)
            {
                mDelayuS( 200 );
                UH_TX_LEN = RemLen >= UsbDevEndp0Size? UsbDevEndp0Size: RemLen;
// memcpy( TxBuffer, pBuf, UH_TX_LEN );
// pBuf += UH_TX_LEN;
                for (TxCnt = 0; TxCnt != UH_TX_LEN; TxCnt ++)
                {
                    TxBuffer[ TxCnt] = *pBuf;
                    pBuf ++;
                }
                s = USBHostTransact( USB_PID_OUT << 4 | 0x00, UH_TX_CTRL, 200000/20 );// OUT data
                if (s != ERR_SUCCESS)
                {
                    return( s );
                }
                RemLen -= UH_TX_LEN;
                if (pLen)
                {
                    *pLen += UH_TX_LEN; // The total length of actual successful sending and receiving
                }
            }
// UH_TX_LEN = 0x01; // Status phase is IN
        }
    }
    mDelayuS( 200 );
    s = USBHostTransact( (UH_TX_LEN? USB_PID_IN << 4 | 0x00: USB_PID_OUT << 4 | 0x00 ), bUH_R_TOG | bUH_T_TOG, 200000/20 ); // STATUS stage
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (UH_TX_LEN == 0)
    {
        return( ERR_SUCCESS ); // status OUT
    }
    if (USB_RX_LEN == 0)
    {
        return( ERR_SUCCESS ); // Status IN, check the IN status and return data length
    }
    return( ERR_USB_BUF_OVER ); // Error in IN state stage
}
/************************************************* ******************************
* Function Name: CopySetupReqPkg
* Description: Copy control transmission request packet
* Input: PUINT8C pReqPkt control request packet address
* Output: None
* Return: None
************************************************** *****************************/
void CopySetupReqPkg( PUINT8C pReqPkt)
{
    UINT8 i;
    for (i = 0; i != sizeof( USB_SETUP_REQ ); i ++)
    {
        ((PUINT8X)pSetupReq)[ i] = *pReqPkt;
        pReqPkt ++;
    }
}
/************************************************* ******************************
* Function Name: CtrlGetDeviceDescr
* Description: Get the device descriptor and return it in TxBuffer
* Input: None
* Output: None
* Return: ERR_USB_BUF_OVER Descriptor length error
                   ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlGetDeviceDescr( void)
{
    UINT8 s;
    UINT8D len;
    UsbDevEndp0Size = DEFAULT_ENDP0_SIZE;
    CopySetupReqPkg( SetupGetDevDescr );
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    UsbDevEndp0Size = ((PXUSB_DEV_DESCR)TxBuffer) -> bMaxPacketSize0;// The maximum packet length of endpoint 0, which is simplified processing. Normally, you should get the first 8 bytes and immediately update UsbDevEndp0Size before continuing
    if (len <((PUSB_SETUP_REQ)SetupGetDevDescr) -> wLengthL)
    {
        return( ERR_USB_BUF_OVER ); // Descriptor length error
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: CtrlGetConfigDescr
* Description: Get the configuration descriptor and return it in TxBuffer
* Input: None
* Output: None
* Return: ERR_USB_BUF_OVER Descriptor length error
                   ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlGetConfigDescr( void)
{
    UINT8 s;
    UINT8D len;
    CopySetupReqPkg( SetupGetCfgDescr );
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (len <((PUSB_SETUP_REQ)SetupGetCfgDescr) -> wLengthL)
    {
        return( ERR_USB_BUF_OVER ); // Return length error
    }
    len = ((PXUSB_CFG_DESCR)TxBuffer) -> wTotalLengthL;
    if (len> MAX_PACKET_SIZE)
    {
        return( ERR_USB_BUF_OVER ); // Return length error
    }
    CopySetupReqPkg( SetupGetCfgDescr );
    pSetupReq -> wLengthL = len; // Total length of the complete configuration descriptor
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (len <((PUSB_SETUP_REQ)SetupGetCfgDescr) -> wLengthL || len <((PXUSB_CFG_DESCR)TxBuffer) -> wTotalLengthL)
    {
        return( ERR_USB_BUF_OVER ); // Descriptor length error
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: CtrlSetUsbAddress
* Description: Set the USB device address
* Input: UINT8 addr device address
* Output: None
* Return: ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlSetUsbAddress( UINT8 addr)
{
    UINT8 s;
    CopySetupReqPkg( SetupSetUsbAddr );
    pSetupReq -> wValueL = addr; // USB device address
    s = HostCtrlTransfer( NULL, NULL ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    SetHostUsbAddr( addr ); // Set the USB device address currently operated by the USB host
    mDelaymS( 10 ); // Wait for the USB device to complete the operation
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: CtrlSetUsbConfig
* Description: Set USB device configuration
* Input: UINT8 cfg configuration value
* Output: None
* Return: ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlSetUsbConfig( UINT8 cfg) // Set USB device configuration
{
    CopySetupReqPkg( SetupSetUsbConfig );
    pSetupReq -> wValueL = cfg; // USB device configuration
    return( HostCtrlTransfer( NULL, NULL) ); // Perform control transfer
}
/************************************************* ******************************
* Function Name: CtrlClearEndpStall
* Description: Clear endpoint STALL
* Input: UINT8 endp endpoint address
* Output: None
* Return: ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlClearEndpStall( UINT8 endp)
{
    CopySetupReqPkg( SetupClrEndpStall ); // Clear the error of the endpoint
    pSetupReq -> wIndexL = endp; // endpoint address
    return( HostCtrlTransfer( NULL, NULL) ); // Perform control transfer
}
/************************************************* ******************************
* Function Name: AnalyzeHidIntEndp
* Description: Analyze the address of the HID interrupt endpoint from the descriptor
* Input: PUINT8X buf buffer address of data to be analyzed
* Output: None
* Return: interrupt endpoint address
************************************************** *****************************/
UINT8 AnalyzeHidIntEndp( PUINT8X buf)
{
    UINT8 i, s, l;
    s = 0;
    for (i = 0; i <((PXUSB_CFG_DESCR)buf) -> wTotalLengthL; i += l )// Search interrupt endpoint descriptor, skip configuration descriptor and interface descriptor
    {
        if (((PXUSB_ENDP_DESCR)(buf+i)) -> bDescriptorType == USB_DESCR_TYP_ENDP// is the endpoint descriptor
                && (((PXUSB_ENDP_DESCR)(buf+i)) -> bmAttributes & USB_ENDP_TYPE_MASK) == USB_ENDP_TYPE_INTER // is the interrupt endpoint
                && (((PXUSB_ENDP_DESCR)(buf+i)) -> bEndpointAddress & USB_ENDP_DIR_MASK) )// is the IN endpoint
        {
            s = ((PXUSB_ENDP_DESCR)(buf+i)) -> bEndpointAddress & USB_ENDP_ADDR_MASK;// The address of the interrupt endpoint
            break; // You can save wMaxPacketSize and bInterval as needed
        }
        l = ((PXUSB_ENDP_DESCR)(buf+i)) -> bLength; // current descriptor length, skip
        if (l> 16)
        {
            break;
        }
    }
    return( s );
}
/************************************************* ******************************
* Function Name: InitRootDevice
* Description: Initialize the USB device
* Input: UINT8 RootHubIndex built-in HUB port number 0/1
* Output: None
* Return:
