crowdwave/ch559samplestranslated/EVT/EXAM/USB/U_DISK/EXAM1/EXAM1.C
************************************************** *****************************/
UINT8 InitRootDevice( UINT8 RootHubIndex)
{
    UINT8 i, s, cfg, dv_cls, if_cls;
    printf( "Reset host port\n" );
    ResetRootHubPort( RootHubIndex ); // After detecting the device, reset the USB bus of the corresponding port
    for (i = 0, s = 0; i <100; i ++) // wait for the USB device to reset and reconnect, 100mS timeout
    {
        mDelaymS( 1 );
        if (EnableRootHubPort( RootHubIndex) == ERR_SUCCESS) // Enable port
        {
            i = 0;
            s ++; // Time to wait for the stability of the USB device connection
            if (s> 20)
            {
                break; // has been connected stably for 20mS
            }
        }
    }
    if (i) // device is not connected after reset
    {
        DisableRootHubPort( RootHubIndex );
        printf( "Disable host port because of disconnect\n" );
        return( ERR_USB_DISCON );
    }
SelectHubPort( RootHubIndex);
    printf( "GetDevDescr: ");
    s = CtrlGetDeviceDescr( ); // Get device descriptor
    if (s == ERR_SUCCESS)
    {
        for (i = 0; i <((PUSB_SETUP_REQ)SetupGetDevDescr) -> wLengthL; i ++)
        {
            printf( "x%02X ", (UINT16)( TxBuffer[i]) );
        }
        printf( "\n" ); // display the descriptor
        dv_cls = ((PXUSB_DEV_DESCR)TxBuffer) -> bDeviceClass; // device class code
s = CtrlSetUsbAddress( RootHubIndex + ((PUSB_SETUP_REQ)SetupSetUsbAddr) -> wValueL );//Set the USB device address, plus RootHubIndex can ensure that 2 HUB ports are assigned different addresses
        if (s == ERR_SUCCESS)
        {
RootHubDev[RootHubIndex].DeviceAddress = RootHubIndex + ((PUSB_SETUP_REQ)SetupSetUsbAddr) -> wValueL;// Save the USB address
            printf( "GetCfgDescr: ");
            s = CtrlGetConfigDescr( ); // Get configuration descriptor
            if (s == ERR_SUCCESS)
            {
                cfg = ((PXUSB_CFG_DESCR)TxBuffer) -> bConfigurationValue;
                for (i = 0; i <((PXUSB_CFG_DESCR)TxBuffer) -> wTotalLengthL; i ++)
                {
                    printf( "x%02X ", (UINT16)( TxBuffer[i]) );
                }
                printf("\n");
                /* Analyze the configuration descriptor, get the endpoint data/each endpoint address/each endpoint size, etc., update the variables endp_addr and endp_size, etc. */
                if_cls = ((PXUSB_CFG_DESCR_LONG)TxBuffer) -> itf_descr.bInterfaceClass;// Interface class code
                if (dv_cls == 0x00 && if_cls == USB_DEV_CLASS_STORAGE) // It is a USB storage device, basically confirm it is a U disk
                {
// s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
// if (s == ERR_SUCCESS) {
RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
RootHubDev[RootHubIndex].DeviceType = USB_DEV_CLASS_STORAGE;
printf( "USB-Disk Ready\n" );
SetUsbSpeed( 1 ); // The default is full speed
return( ERR_SUCCESS );
//}
                }
             }
         }
}
    printf( "InitRootDev Err = %02X\n", (UINT16)s );
    CH559DiskStatus = DISK_CONNECT;
    SetUsbSpeed( 1 ); // The default is full speed
    return( s );
}

/************************************************* ******************************
* Function Name: EnumAllRootDevice
* Description: Enumerate all USB devices of ROOT-HUB port
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
UINT8 EnumAllRootDevice( void)
{
UINT8 s, RootHubIndex;
printf( "EnumAllRootDev\n" );
for (RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++) {
if (RootHubDev[RootHubIndex].DeviceStatus == ROOT_DEV_CONNECTED) {// The device has just been inserted and has not been initialized
s = InitRootDevice( RootHubIndex ); // Initialize/enumerate the USB device of the specified HUB port
if (s != ERR_SUCCESS) return( s );
}
}
return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: SearchTypeDevice
* Description: Search for the port number where the specified type of device is located on ROOT-HUB, and the output port number is 0xFFFF, but it is not found
                   The upper 8 bits of the output are the ROOT-HUB port number, the lower 8 bits are the port number of the external HUB, and the lower 8 bits are 0, the device is directly on the ROOT-HUB port
                   Of course, you can also search according to the PID of the USB manufacturer's VID product (record the VID and PID of each device in advance), and specify the search serial number
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
UINT16 SearchTypeDevice( UINT8 type)
{
UINT8 RootHubIndex;
for (RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++) {// The current search can avoid the problem that the device is unplugged in the middle and some information is not updated in time
if (RootHubDev[RootHubIndex].DeviceType == type && RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS) return( (UINT16)RootHubIndex << 8 ); // The type matches and the enumeration is successful, on the ROOT-HUB port
}
return( 0xFFFF );
}
/************************************************* ******************************
* Function Name: InitUSB_Host
* Description: Initialize the USB host
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
void InitUSB_Host( void) // initialize the USB host
{
    IE_USB = 0;
// LED_CFG = 1;
// LED_RUN = 0;
    USB_CTRL = bUC_HOST_MODE; // Set the mode first
    USB_DEV_AD = 0x00;
    UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN;
    UH_RX_DMA = RxBuffer;
    UH_TX_DMA = TxBuffer;
    UH_RX_CTRL = 0x00;
    UH_TX_CTRL = 0x00;
    USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY | bUC_DMA_EN; // Start the USB host and DMA, and automatically pause before the interrupt flag is cleared
// UHUB0_CTRL = 0x00;
// UHUB1_CTRL = 0x00;
    UH_SETUP = bUH_SOF_EN;
    USB_INT_FG = 0xFF; // Clear interrupt flag
    DisableRootHubPort(0); // Clear
    DisableRootHubPort(1); // Clear
    USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
// IE_USB = 1; // query method
}
/************************************************* ******************************
* Function Name: mStopIfError
* Description: Check the operating status, if there is an error, display the error code and stop
* Input: UINT8 iError
* Output: None
* Return: None
************************************************** *****************************/
void mStopIfError( UINT8 iError)
{
    if (iError == ERR_SUCCESS)
    {
        return; // operation is successful
    }
    printf( "Error: %02X\n", (UINT16)iError ); // display error
    /* After encountering an error, you should analyze the error code and CH559DiskStatus status. For example, call CH559DiskReady to query whether the current U disk is connected. If the U disk is disconnected, then wait for the U disk to be plugged in and then operate.
       Suggested processing steps after error:
       1. Call CH559DiskReady once, and continue the operation if successful, such as Open, Read/Write, etc.
       2. If CH559DiskReady is unsuccessful, then forcibly start the operation from the beginning (waiting for U disk connection, CH559DiskReady, etc.) */
    while (1)
    {
// LED_TMP=0; // LED flashes
// mDelaymS( 100 );
// LED_TMP=1;
// mDelaymS( 100 );
    }
}

/************************************************* ******************************
* Function Name: RenameFilename
* Description: File name rewriting
* Input:
                   PUINT8 FilenameBuf file name without path information
* Output: None
* Return: None
************************************************** *****************************/
UINT8 RenameFilename(PUINT8 FilenameBuf,UINT8 len)
{
    UINT8 i;
    PX_FAT_DIR_INFO mFileDir;
i = CH559FileQuery();//Query file information, so that the file information can be transferred to the memory and then modified
if( i == ERR_SUCCESS ){
mFileDir = (PX_FAT_DIR_INFO)(pDISK_BASE_BUF + CH559vFdtOffset);//In the memory, the starting address of the current FDT
      memset(mFileDir->DIR_Name,0x20,11);
      i = 0;
      while(i<len){
        if(FilenameBuf[i] =='.'){
          i++;
          break;//File name suffix
        }
        mFileDir->DIR_Name[i] = FilenameBuf[i];
        i++;
      }
memcpy( &mFileDir->DIR_Name[8], &FilenameBuf[i],len-i );
}
mCmdParam.Modify.mFileAttr = mFileDir->DIR_Attr;
mCmdParam.Modify.mFileTime = 0xffff; //Input parameter: the new file time, if it is 0FFFFH, it will not be modified, and the default time generated by the new file will be used
mCmdParam.Modify.mFileSize = 0xffffffff; //Input parameters: the new file length, the file is written in bytes, the length should be automatically updated when the file is closed by the library, so it is not modified here
i = CH559FileModify( ); //Modify the current file information, modification date
if( i == ERR_SUCCESS ){
mCmdParam.Close.mUpdateLen = 0; //Do not update the file length
i = CH559FileClose( );
}
    return i;
}

void main()
{
    UINT8 s, c,i;
    UINT16 TotalCount,loc;
    UINT8 buf[100]; //The length can be specified according to the application
    UINT8 Rename[6];
    Rename[0]= '2';Rename[1]= '2';Rename[2]= '2';Rename[3]= '2';Rename[4]='.';Rename[5]= 'C';
    mDelaymS(30); //Power-on delay, wait for the internal crystal oscillator to stabilize, must be added
    mInitSTDIO( ); //In order to let the computer monitor the demonstration process through the serial port
    printf( "Start @ChipID=%02X\n", (UINT16)CHIP_ID );
    InitUSB_Host( );
    CH559LibInit( ); //Initialize CH559 library to support U disk files
    FoundNewDev = 0;
    printf( "Wait Device In\n" );
    while (1)
    {
        s = ERR_SUCCESS;
        if (UIF_DETECT) //Process if there is a USB host detection interrupt
        {
            UIF_DETECT = 0; //Clear interrupt flag
            s = AnalyzeRootHub( ); //Analyze ROOT-HUB status
            if (s == ERR_USB_CONNECT)
            {
                FoundNewDev = 1;
            }
        }
        if (FoundNewDev) // There is a new USB device inserted
        {
            FoundNewDev = 0;
            mDelaymS( 200 ); // Since the USB device has just been inserted and is not yet stable, wait for hundreds of milliseconds for the USB device to eliminate the plugging jitter
s = EnumAllRootDevice( ); // Enumerate USB devices of all ROOT-HUB ports
            loc = SearchTypeDevice( USB_DEV_CLASS_STORAGE ); // Search for the port number of the specified type of device on each port of ROOT-HUB and external HUB
if (loc != 0xFFFF) {// found
printf( "Start UDISK_demo @CH559UFI library\n" );
// U disk operation process: USB bus reset, U disk connection, get device descriptor and set USB address, optional get configuration descriptor, then arrive here, CH559 subroutine library will continue to complete the follow-up work
i = (UINT8)( loc >> 8 );
SelectHubPort(i); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
CH559DiskStatus = DISK_USB_ADDR;
for (i = 0; i != 10; i ++)
{
printf( "Wait DiskReady\n" );
s = CH559DiskReady( );
if (s == ERR_SUCCESS)
{
break;
}
mDelaymS( 50 );
}
if (CH559DiskStatus >= DISK_MOUNTED) //U disk is ready
{
/* Read the original file */
printf( "Open File\n" );
strcpy( mCmdParam.Open.mPathName, "/C51/CH559HFT.C" ); //File name, the file is in the C51 subdirectory
s = CH559FileOpen( ); //Open the file
if (s == ERR_MISS_DIR || s == ERR_MISS_FILE )//No file found
{
printf( "File not found\n" );
}
else // find the file or error
{
TotalCount = 100; //Ready to read the total length
printf( "The first %d characters read from the file are:\n",TotalCount );
while (TotalCount) //If the file is large and cannot be read at one time, you can call CH559ByteRead to continue reading, and the file pointer will automatically move backward
{
if (TotalCount> (MAX_PATH_LEN-1))
{
c = MAX_PATH_LEN-1; //There are many remaining data, and the length of a single read and write cannot exceed sizeof( mCmdParam.Other.mBuffer)
}
else
{
c = TotalCount; //The last remaining number of bytes
}
mCmdParam.ByteRead.mByteCount = c; //Request to read dozens of bytes of data
mCmdParam.ByteRead.mByteBuffer= &buf[0];
s = CH559ByteRead( ); //Read the data block in bytes, the length of a single read and write cannot exceed MAX_BYTE_IO, and the second call is followed by the previous read
TotalCount -= mCmdParam.ByteRead.mByteCount;//Count, minus the current number of characters actually read
for (i=0; i!=mCmdParam.ByteRead.mByteCount; i++)
{
printf( "%C", mCmdParam.ByteRead.mByteBuffer[i] );//Display the read character
}
if (mCmdParam.ByteRead.mByteCount <c )//The number of characters actually read is less than the number of characters required to read, indicating that the end of the file has been reached
{
printf( "\n" );
printf( "File has ended\n" );
break;
}
}
printf( "Close\n" );
i = CH559FileClose( ); //Close the file
mStopIfError( i );
}
/* If you want to start reading and writing from the specified position, you can move the file pointer
mCmdParam.ByteLocate.mByteOffset = 608; //Skip the first 608 bytes of the file to start reading and writing
CH559ByteLocate( );
mCmdParam.ByteRead.mByteCount = 5; //Read 5 bytes
mCmdParam.ByteRead.mByteBuffer= &buf[0];
CH559ByteRead( ); //Read the data from the 608th byte to the 612th byte of the file directly, the first 608 bytes are skipped
//If you want to add new data to the end of the original file, you can move the file pointer
CH559FileOpen( );
mCmdParam.ByteLocate.mByteOffset = 0xffffffff;//Move to the end of the file
CH559ByteLocate( );
mCmdParam.ByteWrite.mByteCount = 13; //Write 13 bytes of data
CH559ByteWrite( ); //Add data at the end of the original file, and the newly added 13 bytes are placed at the end of the original file
mCmdParam.ByteWrite.mByteCount = 2; //Write 2 bytes of data
CH559ByteWrite( ); //Continue to add data after the original file
mCmdParam.ByteWrite.mByteCount = 0; //Write 0 bytes of data, in fact, this operation is used to notify the library to update the file length
CH559ByteWrite( ); //Write 0 bytes of data to automatically update the length of the file, so the file length is increased by 15. If you don't do this, the file length will be automatically updated when CH559FileClose
*/
printf( "Create File\n" );
strcpy( mCmdParam.Create.mPathName, "/NEWFILE.TXT" );//New file name, in the root directory, Chinese file name
s = CH559FileCreate( ); //Create a new file and open it, if the file already exists, delete it and then create it
mStopIfError( s );
printf( "ByteWrite\n" );
//Actually, it should be judged whether the length of the written data matches the length of the defined buffer. If it is greater than the length of the buffer, multiple writes are required
i = sprintf( buf,"Note: \xd\xa This program reads and writes U disk files in bytes, 559 simple demonstration functions. \xd\xa");/*Demo */
for(c=0; c<10; c++)
{
mCmdParam.ByteWrite.mByteCount = i; /* Specify the number of bytes written this time */
mCmdParam.ByteWrite.mByteBuffer = buf; /* point to buffer */
s = CH559ByteWrite( ); /* Write data to the file in bytes */
mStopIfError( s );
printf("Successfully written %02X times\n",(UINT16)c);
}
printf( "Modify\n" );
mCmdParam.Modify.mFileAttr = 0xff; //Input parameter: new file attribute, if it is 0FFH, it will not be modified
mCmdParam.Modify.mFileTime = 0xffff; //Input parameter: new file time, if it is 0FFFFH, do not modify it, use the default time generated by the newly created file
mCmdParam.Modify.mFileDate = MAKE_FILE_DATE( 2020, 8, 15 ); //Input parameters: new file date: 2016.01.15
mCmdParam.Modify.mFileSize = 0xffffffff; //Input parameters: the new file length, the file is written in bytes, the length should be automatically updated when the file is closed by the library, so it is not modified here
i = CH559FileModify( ); //Modify the current file information, modification date
mStopIfError( i );
printf( "Close\n" );
mCmdParam.Close.mUpdateLen = 1; //Automatically calculate the file length and write the file in bytes. It is recommended that the library close the file to automatically update the file length
i = CH559FileClose( );
mStopIfError( i );
printf( "RenameFilename\n" );
strcpy( mCmdParam.Open.mPathName, "/111.TXT" ); //File name, the file is in the C51 subdirectory
s = CH559FileOpen( ); //Open the file
if(s == ERR_SUCCESS){
i = RenameFilename(Rename,sizeof(Rename));
if (i != ERR_SUCCESS) printf( "Error Rename fail: %02X\n", (UINT16)i );//Display error
}
/* Delete a file */
printf( "Delete\n" );
strcpy( mCmdParam.Create.mPathName, "/OLD.TXT" );//The name of the file to be deleted, in the root directory
i = CH559FileErase( ); //Delete the file and close
if (i != ERR_SUCCESS) printf( "Error File not exist: %02X\n", (UINT16)i );//Display error
To
printf( "U disk demo complete\n" );
}
else
{
printf( "U disk is not ready ERR =%02X\n", (UINT16)s );
}
}
        }
        mDelaymS( 100 ); // simulate the MCU to do other things
        SetUsbSpeed( 1 ); // The default is full speed
    }
}
